In [107]:
import pandas as pd
import numpy as np

In [108]:
np.random.rand()

0.2762813202611858

In [109]:
s1=pd.Series(np.random.rand(10),dtype=float)
print(s1,type(s1))

0    0.333659
1    0.670425
2    0.192254
3    0.513502
4    0.008917
5    0.593662
6    0.603221
7    0.279537
8    0.826835
9    0.800202
dtype: float64 <class 'pandas.core.series.Series'>

## create a data frame with randomly generated contents of a column having 9 random values and second column is double of the first one

In [110]:
s=np.random.rand(9)
print(s,type(s))
s*100

[0.59857363 0.49266795 0.97123359 0.73420623 0.49881091 0.7291844
 0.49751606 0.92696618 0.44319134] <class 'numpy.ndarray'>

array([59.85736274, 49.26679492, 97.12335878, 73.42062271, 49.88109103,
       72.91844011, 49.75160572, 92.69661793, 44.3191342 ])

In [10]:
frame = pd.DataFrame(s,  columns=['first'])
display(frame)
frame['second']=frame['first']*2
display(frame)

      first
0  0.657524
1  0.903047
2  0.561871
3  0.251597
4  0.833607
5  0.380981
6  0.403838
7  0.525121
8  0.020277

      first    second
0  0.657524  1.315047
1  0.903047  1.806094
2  0.561871  1.123742
3  0.251597  0.503195
4  0.833607  1.667213
5  0.380981  0.761961
6  0.403838  0.807676
7  0.525121  1.050243
8  0.020277  0.040554

## find the output?

In [111]:
frame1 = pd.DataFrame(s.reshape((3, 3)), index=['2001', '2002', '2003'], columns=['Ohio', 'Texas', 'California'])
print(frame1)

          Ohio     Texas  California
2001  0.598574  0.492668    0.971234
2002  0.734206  0.498811    0.729184
2003  0.497516  0.926966    0.443191

## reindexing uses outer join

In [112]:
frame2 = frame1.reindex(['2001', '2002', '2004', '2005'])
print(frame2)

          Ohio     Texas  California
2001  0.598574  0.492668    0.971234
2002  0.734206  0.498811    0.729184
2004       NaN       NaN         NaN
2005       NaN       NaN         NaN

In [113]:
frame1['XXX']=-90

In [103]:
frame1

      Maximum       Ohio     Texas  California  XXX  YYYY1
2001      8.0   8.000000  8.000000    8.000000  -90    8.0
2002      8.0   8.000000  8.000000    8.000000  -90    8.0
2003     20.0   0.403838  0.525121    0.020277  -90   20.0
g        10.0   0.000000  2.000000    4.000000  -90   10.0
g1       10.0  10.000000  3.000000    4.000000  -90    6.0

In [114]:
L=[21,20,20]

## inserting a new column at the specified location using list. size of elements in the new coulmn must match so that existing row indexes are used, duplicate columns are allowed

In [115]:
frame1.insert(4, "YYYY1", L, True)

In [106]:
frame1

      Maximum       Ohio     Texas  California  XXX  YYYY1
2001      8.0   8.000000  8.000000    8.000000  -90    8.0
2002      8.0   8.000000  8.000000    8.000000  -90    8.0
2003     20.0   0.403838  0.525121    0.020277  -90   20.0
g        10.0   0.000000  2.000000    4.000000  -90   10.0
g1       10.0  10.000000  3.000000    4.000000  -90    6.0

## inserting a series as a column. Only common Indexes are (Outer join) used and the remaining indexes of the data frame are assigned None value

In [116]:
s1=pd.Series(np.random.rand(4),dtype=float,index=['a','b','c','d'])

## duplicate column names are allowed

In [117]:
frame1.columns[2]

'California'

In [118]:
frame1.insert(3, "YYYY", L, True)
frame1

          Ohio     Texas  California  YYYY  XXX  YYYY1
2001  0.598574  0.492668    0.971234    21  -90     21
2002  0.734206  0.498811    0.729184    20  -90     20
2003  0.497516  0.926966    0.443191    20  -90     20

In [119]:
frame1

          Ohio     Texas  California  YYYY  XXX  YYYY1
2001  0.598574  0.492668    0.971234    21  -90     21
2002  0.734206  0.498811    0.729184    20  -90     20
2003  0.497516  0.926966    0.443191    20  -90     20

## appending rows in data frame1. in-place change

In [120]:
frame1.loc['g']=range(0,len(frame1.columns)*2,2)

In [121]:
frame1

          Ohio     Texas  California  YYYY  XXX  YYYY1
2001  0.598574  0.492668    0.971234    21  -90     21
2002  0.734206  0.498811    0.729184    20  -90     20
2003  0.497516  0.926966    0.443191    20  -90     20
g     0.000000  2.000000    4.000000     6    8     10

## Find total of each column and add as last row

In [122]:
s1=frame1.sum()
s1.name='total'

In [123]:
frame1.append(s1)

C:\Users\keshav\AppData\Local\Temp\ipykernel_7648\3913218282.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  frame1.append(s1)

           Ohio     Texas  California  YYYY    XXX  YYYY1
2001   0.598574  0.492668    0.971234  21.0  -90.0   21.0
2002   0.734206  0.498811    0.729184  20.0  -90.0   20.0
2003   0.497516  0.926966    0.443191  20.0  -90.0   20.0
g      0.000000  2.000000    4.000000   6.0    8.0   10.0
total  1.830296  3.918445    6.143609  67.0 -262.0   71.0

In [124]:
frame1

          Ohio     Texas  California  YYYY  XXX  YYYY1
2001  0.598574  0.492668    0.971234    21  -90     21
2002  0.734206  0.498811    0.729184    20  -90     20
2003  0.497516  0.926966    0.443191    20  -90     20
g     0.000000  2.000000    4.000000     6    8     10

## adding row thru appending

In [125]:
labels=frame1.columns
l=len(frame1.columns)

In [126]:
s1=pd.Series(3*np.random.rand(l),dtype=float,index=labels)
s1.name='bb'
s1

Ohio          2.738306
Texas         1.427421
California    0.889843
YYYY          1.901296
XXX           1.464135
YYYY1         2.907108
Name: bb, dtype: float64

In [127]:
frame

      first    second
0  0.657524  1.315047
1  0.903047  1.806094
2  0.561871  1.123742
3  0.251597  0.503195
4  0.833607  1.667213
5  0.380981  0.761961
6  0.403838  0.807676
7  0.525121  1.050243
8  0.020277  0.040554

## append() does not do in-place change

In [128]:
frame1.append(s1)

C:\Users\keshav\AppData\Local\Temp\ipykernel_7648\3913218282.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  frame1.append(s1)

          Ohio     Texas  California       YYYY        XXX      YYYY1
2001  0.598574  0.492668    0.971234  21.000000 -90.000000  21.000000
2002  0.734206  0.498811    0.729184  20.000000 -90.000000  20.000000
2003  0.497516  0.926966    0.443191  20.000000 -90.000000  20.000000
g     0.000000  2.000000    4.000000   6.000000   8.000000  10.000000
bb    2.738306  1.427421    0.889843   1.901296   1.464135   2.907108

## dropping all columns with same name

In [130]:
display(frame1)

frame1.drop("YYYY",axis=1,inplace=True)
display(frame1)

          Ohio     Texas  California  XXX  YYYY1
2001  0.598574  0.492668    0.971234  -90     21
2002  0.734206  0.498811    0.729184  -90     20
2003  0.497516  0.926966    0.443191  -90     20
g     0.000000  2.000000    4.000000    8     10

KeyError: "['YYYY'] not found in axis"

In [131]:
frame1

          Ohio     Texas  California  XXX  YYYY1
2001  0.598574  0.492668    0.971234  -90     21
2002  0.734206  0.498811    0.729184  -90     20
2003  0.497516  0.926966    0.443191  -90     20
g     0.000000  2.000000    4.000000    8     10

## in case data series added has axis labels different from the cols label of the data frame, then new columns (extra) will be added

In [132]:
s2=pd.Series(range(4))
print(l)
print(s2)

6
0    0
1    1
2    2
3    3
dtype: int64

In [133]:
frame1.index.is_unique

True

In [134]:
frame1.columns.is_unique

True

#error occurs in case labels are duplicate. If row index are not in series, then default indexes are used. set ignore_index=T

In [137]:
frame1.append(s2,ignore_index=True)

C:\Users\keshav\AppData\Local\Temp\ipykernel_7648\1172876507.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  frame1.append(s2,ignore_index=True)

       Ohio     Texas  California   XXX  YYYY1    0    1    2    3
0  0.598574  0.492668    0.971234 -90.0   21.0  NaN  NaN  NaN  NaN
1  0.734206  0.498811    0.729184 -90.0   20.0  NaN  NaN  NaN  NaN
2  0.497516  0.926966    0.443191 -90.0   20.0  NaN  NaN  NaN  NaN
3  0.000000  2.000000    4.000000   8.0   10.0  NaN  NaN  NaN  NaN
4       NaN       NaN         NaN   NaN    NaN  0.0  1.0  2.0  3.0

In [37]:
frame1

          Ohio     Texas  California  XXX  YYYY1
2001  0.657524  0.903047    0.561871  -90     21
2002  0.251597  0.833607    0.380981  -90     20
2003  0.403838  0.525121    0.020277  -90     20
g     0.000000  2.000000    4.000000    8     10

In [39]:
col1=frame1.columns

In [140]:
s1=pd.Series(range(len(col1)),index=col1)
s1=s1+2

In [141]:
s1

Ohio          2
Texas         3
California    4
XXX           5
YYYY1         6
dtype: int64

In [42]:
frame1

          Ohio     Texas  California  XXX  YYYY1
2001  0.657524  0.903047    0.561871  -90     21
2002  0.251597  0.833607    0.380981  -90     20
2003  0.403838  0.525121    0.020277  -90     20
g     0.000000  2.000000    4.000000    8     10

## while appending set ignore_index=True which will set row index to default index values.
In case series has a name, then it will be label of the row

In [144]:
frame1.append(s1,ignore_index=True)

C:\Users\keshav\AppData\Local\Temp\ipykernel_7648\3211021238.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  frame1.append(s1,ignore_index=True)

       Ohio     Texas  California  XXX  YYYY1
0  0.598574  0.492668    0.971234  -90     21
1  0.734206  0.498811    0.729184  -90     20
2  0.497516  0.926966    0.443191  -90     20
3  0.000000  2.000000    4.000000    8     10
4  2.000000  3.000000    4.000000    5      6

In [146]:
s1.name='g1'

In [147]:
frame1=frame1.append(s1)

C:\Users\keshav\AppData\Local\Temp\ipykernel_7648\3080025563.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  frame1=frame1.append(s1)

In [46]:
frame1

          Ohio     Texas  California  XXX  YYYY1
2001  0.657524  0.903047    0.561871  -90     21
2002  0.251597  0.833607    0.380981  -90     20
2003  0.403838  0.525121    0.020277  -90     20
g     0.000000  2.000000    4.000000    8     10
g1    2.000000  3.000000    4.000000    5      6

In [47]:
frame1.iloc[4,0]=10

## dropping row with duplicate rows and keeping first row

In [48]:
frame1

           Ohio     Texas  California  XXX  YYYY1
2001   0.657524  0.903047    0.561871  -90     21
2002   0.251597  0.833607    0.380981  -90     20
2003   0.403838  0.525121    0.020277  -90     20
g      0.000000  2.000000    4.000000    8     10
g1    10.000000  3.000000    4.000000    5      6

In [49]:
L=frame1.loc['g1'].values
frame1.loc['g2']=L

In [50]:
frame1

           Ohio     Texas  California   XXX  YYYY1
2001   0.657524  0.903047    0.561871 -90.0   21.0
2002   0.251597  0.833607    0.380981 -90.0   20.0
2003   0.403838  0.525121    0.020277 -90.0   20.0
g      0.000000  2.000000    4.000000   8.0   10.0
g1    10.000000  3.000000    4.000000   5.0    6.0
g2    10.000000  3.000000    4.000000   5.0    6.0

In [148]:
frame1=frame1.drop_duplicates(keep='first')

## have a new column with maximum value of states at a first position

In [149]:
frame1.max(axis=1)

2001    21.0
2002    20.0
2003    20.0
g       10.0
g1       6.0
dtype: float64

In [150]:
frame1.insert(0, "Maximum", frame1.max(axis=1),True)

In [151]:
frame1

      Maximum      Ohio     Texas  California  XXX  YYYY1
2001     21.0  0.598574  0.492668    0.971234  -90     21
2002     20.0  0.734206  0.498811    0.729184  -90     20
2003     20.0  0.497516  0.926966    0.443191  -90     20
g        10.0  0.000000  2.000000    4.000000    8     10
g1        6.0  2.000000  3.000000    4.000000    5      6

In [55]:
frame1.iloc[0,3]=-0.99

In [56]:
frame1.iloc[0:2,:]

      Maximum      Ohio     Texas  California   XXX  YYYY1
2001     21.0  0.657524  0.903047   -0.990000 -90.0   21.0
2002     20.0  0.251597  0.833607    0.380981 -90.0   20.0

In [57]:
frame1=np.abs(frame1)
frame1

      Maximum       Ohio     Texas  California   XXX  YYYY1
2001     21.0   0.657524  0.903047    0.990000  90.0   21.0
2002     20.0   0.251597  0.833607    0.380981  90.0   20.0
2003     20.0   0.403838  0.525121    0.020277  90.0   20.0
g        10.0   0.000000  2.000000    4.000000   8.0   10.0
g1       10.0  10.000000  3.000000    4.000000   5.0    6.0

## Subtract 2 from first two rows of the data frame

In [58]:
frame1.iloc[0:2,:]=10

In [59]:
frame1

      Maximum       Ohio      Texas  California   XXX  YYYY1
2001     10.0  10.000000  10.000000   10.000000  10.0   10.0
2002     10.0  10.000000  10.000000   10.000000  10.0   10.0
2003     20.0   0.403838   0.525121    0.020277  90.0   20.0
g        10.0   0.000000   2.000000    4.000000   8.0   10.0
g1       10.0  10.000000   3.000000    4.000000   5.0    6.0

In [60]:
frame1.iloc[0:2,:]-=2

In [61]:
frame1

      Maximum       Ohio     Texas  California   XXX  YYYY1
2001      8.0   8.000000  8.000000    8.000000   8.0    8.0
2002      8.0   8.000000  8.000000    8.000000   8.0    8.0
2003     20.0   0.403838  0.525121    0.020277  90.0   20.0
g        10.0   0.000000  2.000000    4.000000   8.0   10.0
g1       10.0  10.000000  3.000000    4.000000   5.0    6.0

## Applying user-defined function  on each column to get difference in max and min values of each column

In [154]:
f = lambda x: x.max() - x.min()
display(frame1.apply(f))
frame1

Maximum       15.000000
Ohio           2.000000
Texas          2.507332
California     3.556809
XXX           98.000000
YYYY1         15.000000
dtype: float64

      Maximum      Ohio     Texas  California  XXX  YYYY1
2001     21.0  0.598574  0.492668    0.971234  -90     21
2002     20.0  0.734206  0.498811    0.729184  -90     20
2003     20.0  0.497516  0.926966    0.443191  -90     20
g        10.0  0.000000  2.000000    4.000000    8     10
g1        6.0  2.000000  3.000000    4.000000    5      6

## applying function row-wise

In [156]:
frame1

      Maximum      Ohio     Texas  California  XXX  YYYY1
2001     21.0  0.598574  0.492668    0.971234  -90     21
2002     20.0  0.734206  0.498811    0.729184  -90     20
2003     20.0  0.497516  0.926966    0.443191  -90     20
g        10.0  0.000000  2.000000    4.000000    8     10
g1        6.0  2.000000  3.000000    4.000000    5      6

In [64]:
frame1.apply(f,axis='columns')

2001     0.000000
2002     0.000000
2003    89.979723
g       10.000000
g1       7.000000
dtype: float64

In [65]:
frame1.apply(f,axis=1)

2001     0.000000
2002     0.000000
2003    89.979723
g       10.000000
g1       7.000000
dtype: float64

In [66]:
frame1.apply(f,axis=0)

Maximum       12.000000
Ohio          10.000000
Texas          7.474879
California     7.979723
XXX           85.000000
YYYY1         14.000000
dtype: float64

## find mean values for each column, by default it is column for data frame

In [67]:
frame1.mean(axis=0)

Maximum       11.200000
Ohio           5.280768
Texas          4.305024
California     4.804055
XXX           23.800000
YYYY1         10.400000
dtype: float64

## count values greater than mean of DF for each row and store as a new column

In [204]:
frame1 = np.abs(frame1)
display(frame1)
df_mean = frame1.mean().mean()
print(df_mean)

# lambda function to count values > than mean in a row
f = lambda x :  (x>df_mean).sum()

frame1['Greater than mean'] = frame1.apply(f,axis=1)
frame1

      Maximum      Ohio     Texas  California  XXX  YYYY1  Greater than mean
2001     21.0       NaN  0.492668    0.971234   90     21                NaN
2002     20.0  0.734206  0.498811    0.729184   90     20                NaN
2003     20.0  0.497516  0.926966    0.443191   90     20                NaN
g        10.0  0.000000  2.000000    4.000000    8     10                NaN
g1        6.0  2.000000  3.000000    4.000000    5      6                NaN

15.270056907502187

      Maximum      Ohio     Texas  California  XXX  YYYY1  Greater than mean
2001     21.0       NaN  0.492668    0.971234   90     21                  3
2002     20.0  0.734206  0.498811    0.729184   90     20                  3
2003     20.0  0.497516  0.926966    0.443191   90     20                  3
g        10.0  0.000000  2.000000    4.000000    8     10                  0
g1        6.0  2.000000  3.000000    4.000000    5      6                  0

In [173]:
frame1.median()

Maximum              20.000000
Ohio                  0.598574
Texas                 0.926966
California            0.971234
XXX                  90.000000
YYYY1                20.000000
Greater than mean     3.000000
dtype: float64

#add all  values of the specified columns

In [174]:
frame1

      Maximum      Ohio     Texas  California  XXX  YYYY1  Greater than mean
2001     21.0  0.598574  0.492668    0.971234   90     21                  3
2002     20.0  0.734206  0.498811    0.729184   90     20                  3
2003     20.0  0.497516  0.926966    0.443191   90     20                  3
g        10.0  0.000000  2.000000    4.000000    8     10                  0
g1        6.0  2.000000  3.000000    4.000000    5      6                  0

In [175]:
frame1[['Ohio','XXX']].sum(axis=0)

Ohio      3.830296
XXX     283.000000
dtype: float64

In [176]:
frame1[['Ohio','XXX']].mean(axis=1)

2001    45.299287
2002    45.367103
2003    45.248758
g        4.000000
g1       3.500000
dtype: float64

#applied function may also return a series (i.e. multiple values)

In [177]:
def f(x):
    return pd.Series([x.min(), x.max(),x.mean()], index=['min', 'max','avg'])
frame1.apply(f)

     Maximum      Ohio     Texas  California   XXX  YYYY1  Greater than mean
min      6.0  0.000000  0.492668    0.443191   5.0    6.0                0.0
max     21.0  2.000000  3.000000    4.000000  90.0   21.0                3.0
avg     15.4  0.766059  1.383689    2.028722  56.6   15.4                1.8

## problem to do: can a lambda function return multiple values?

In [178]:
f1=lambda x: (x.min(),x.max(),x.mean())
f2=frame1.apply(f1)
f2

   Maximum      Ohio     Texas  California   XXX  YYYY1  Greater than mean
0      6.0  0.000000  0.492668    0.443191   5.0    6.0                0.0
1     21.0  2.000000  3.000000    4.000000  90.0   21.0                3.0
2     15.4  0.766059  1.383689    2.028722  56.6   15.4                1.8

In [75]:
type(f2)

pandas.core.frame.DataFrame

## element-wise operation

In [76]:
frame1

      Maximum       Ohio     Texas  California   XXX  YYYY1
2001      8.0   8.000000  8.000000    8.000000   8.0    8.0
2002      8.0   8.000000  8.000000    8.000000   8.0    8.0
2003     20.0   0.403838  0.525121    0.020277  90.0   20.0
g        10.0   0.000000  2.000000    4.000000   8.0   10.0
g1       10.0  10.000000  3.000000    4.000000   5.0    6.0

#adding 20 to all elements of DF

In [77]:
frame1+20

      Maximum       Ohio      Texas  California    XXX  YYYY1
2001     28.0  28.000000  28.000000   28.000000   28.0   28.0
2002     28.0  28.000000  28.000000   28.000000   28.0   28.0
2003     40.0  20.403838  20.525121   20.020277  110.0   40.0
g        30.0  20.000000  22.000000   24.000000   28.0   30.0
g1       30.0  30.000000  23.000000   24.000000   25.0   26.0

## using applymap() to apply a specific operation on data elements

In [179]:
f1 = lambda x: np.sqrt(x)+x**2 if (x is not None and x >=0) else 0

In [180]:
s1=pd.Series(range(5))
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [181]:
s1[4]=-90
s1

0     0
1     1
2     2
3     3
4   -90
dtype: int64

## find the output?

In [81]:
s1.apply(f1)

0     0.000000
1     2.000000
2     5.414214
3    10.732051
4     0.000000
dtype: float64

In [182]:
frame1

      Maximum      Ohio     Texas  California  XXX  YYYY1  Greater than mean
2001     21.0  0.598574  0.492668    0.971234   90     21                  3
2002     20.0  0.734206  0.498811    0.729184   90     20                  3
2003     20.0  0.497516  0.926966    0.443191   90     20                  3
g        10.0  0.000000  2.000000    4.000000    8     10                  0
g1        6.0  2.000000  3.000000    4.000000    5      6                  0

In [185]:
frame1.applymap(f1)

,Maximum,Ohio,Texas,California,XXX,YYYY1,Greater than mean
2001,445.582576,1.131966,0.944625,1.928807,8109.486833,445.582576,10.732051
2002,404.472136,1.395917,0.955078,1.385633,8109.486833,404.472136,10.732051
2003,404.472136,0.952870,1.822057,0.862145,8109.486833,404.472136,10.732051
g,103.162278,0.000000,5.414214,18.000000,66.828427,103.162278,0.000000
g1,38.449490,5.414214,10.732051,18.000000,27.236068,38.449490,0.000000

In [84]:
frame1

      Maximum       Ohio     Texas  California   XXX  YYYY1
2001      8.0   8.000000  8.000000    8.000000   8.0    8.0
2002      8.0   8.000000  8.000000    8.000000   8.0    8.0
2003     20.0   0.403838  0.525121    0.020277  90.0   20.0
g        10.0   0.000000  2.000000    4.000000   8.0   10.0
g1       10.0  10.000000  3.000000    4.000000   5.0    6.0

#Sorting and ranking

In [85]:
frame1.sort_index()

      Maximum       Ohio     Texas  California   XXX  YYYY1
2001      8.0   8.000000  8.000000    8.000000   8.0    8.0
2002      8.0   8.000000  8.000000    8.000000   8.0    8.0
2003     20.0   0.403838  0.525121    0.020277  90.0   20.0
g        10.0   0.000000  2.000000    4.000000   8.0   10.0
g1       10.0  10.000000  3.000000    4.000000   5.0    6.0

#sorting column names in data frame

In [86]:
frame1.sort_index(axis=1,ascending=False)

      YYYY1   XXX     Texas       Ohio  Maximum  California
2001    8.0   8.0  8.000000   8.000000      8.0    8.000000
2002    8.0   8.0  8.000000   8.000000      8.0    8.000000
2003   20.0  90.0  0.525121   0.403838     20.0    0.020277
g      10.0   8.0  2.000000   0.000000     10.0    4.000000
g1      6.0   5.0  3.000000  10.000000     10.0    4.000000

#sorting on values

In [190]:
frame1.sort_values('Ohio')

      Maximum      Ohio     Texas  California  XXX  YYYY1  Greater than mean
g        10.0  0.000000  2.000000    4.000000    8     10                  0
2003     20.0  0.497516  0.926966    0.443191   90     20                  3
2001     21.0  0.598574  0.492668    0.971234   90     21                  3
2002     20.0  0.734206  0.498811    0.729184   90     20                  3
g1        6.0  2.000000  3.000000    4.000000    5      6                  0

 ## impact of Nan on sorting, these values are pushed to the end

In [191]:
frame1.iloc[0,1]=None

In [192]:
frame1

      Maximum      Ohio     Texas  California  XXX  YYYY1  Greater than mean
2001     21.0       NaN  0.492668    0.971234   90     21                  3
2002     20.0  0.734206  0.498811    0.729184   90     20                  3
2003     20.0  0.497516  0.926966    0.443191   90     20                  3
g        10.0  0.000000  2.000000    4.000000    8     10                  0
g1        6.0  2.000000  3.000000    4.000000    5      6                  0

In [195]:
frame1.sort_values(by='California')

      Maximum      Ohio     Texas  California  XXX  YYYY1  Greater than mean
2003     20.0  0.497516  0.926966    0.443191   90     20                  3
2002     20.0  0.734206  0.498811    0.729184   90     20                  3
2001     21.0       NaN  0.492668    0.971234   90     21                  3
g        10.0  0.000000  2.000000    4.000000    8     10                  0
g1        6.0  2.000000  3.000000    4.000000    5      6                  0

In [196]:
frame1.sort_values(by=['Ohio','XXX'])

      Maximum      Ohio     Texas  California  XXX  YYYY1  Greater than mean
g        10.0  0.000000  2.000000    4.000000    8     10                  0
2003     20.0  0.497516  0.926966    0.443191   90     20                  3
2002     20.0  0.734206  0.498811    0.729184   90     20                  3
g1        6.0  2.000000  3.000000    4.000000    5      6                  0
2001     21.0       NaN  0.492668    0.971234   90     21                  3

## ranking of rows: rank() method returns a rank of every respective element of a series/dataframe passed. The rank is returned on the basis of position after sorting. In case of ties, mean is taken as rank

In [197]:
frame1

      Maximum      Ohio     Texas  California  XXX  YYYY1  Greater than mean
2001     21.0       NaN  0.492668    0.971234   90     21                  3
2002     20.0  0.734206  0.498811    0.729184   90     20                  3
2003     20.0  0.497516  0.926966    0.443191   90     20                  3
g        10.0  0.000000  2.000000    4.000000    8     10                  0
g1        6.0  2.000000  3.000000    4.000000    5      6                  0

## deafult in data frame is row-wise (axis=0) i.e. for each column, rank() generates rank using mean() for same values

In [198]:
frame1.rank()

      Maximum  Ohio  Texas  California  XXX  YYYY1  Greater than mean
2001      5.0   NaN    1.0         3.0  4.0    5.0                4.0
2002      3.5   3.0    2.0         2.0  4.0    3.5                4.0
2003      3.5   2.0    3.0         1.0  4.0    3.5                4.0
g         2.0   1.0    4.0         4.5  2.0    2.0                1.5
g1        1.0   4.0    5.0         4.5  1.0    1.0                1.5

In [199]:
frame1

      Maximum      Ohio     Texas  California  XXX  YYYY1  Greater than mean
2001     21.0       NaN  0.492668    0.971234   90     21                  3
2002     20.0  0.734206  0.498811    0.729184   90     20                  3
2003     20.0  0.497516  0.926966    0.443191   90     20                  3
g        10.0  0.000000  2.000000    4.000000    8     10                  0
g1        6.0  2.000000  3.000000    4.000000    5      6                  0

#rank row-wise

In [200]:
frame1.rank(axis=1)

      Maximum  Ohio  Texas  California  XXX  YYYY1  Greater than mean
2001      4.5   NaN    1.0         2.0  6.0    4.5                3.0
2002      5.5   3.0    1.0         2.0  7.0    5.5                4.0
2003      5.5   2.0    3.0         1.0  7.0    5.5                4.0
g         6.5   1.5    3.0         4.0  5.0    6.5                1.5
g1        6.5   2.0    3.0         4.0  5.0    6.5                1.0

#Assign different ranks as per apperance of value

In [ ]:
s2= pd.Series([8, -5, 8, 4, 2, 3, -5, 4])
s2.sort_values(ascending=False)

0    8
2    8
3    4
7    4
5    3
4    2
1   -5
6   -5
dtype: int64

## assign max ranks to equal values

In [201]:
maxrank=s2.rank(method='min')
maxrank

0    1.0
1    2.0
2    3.0
3    4.0
dtype: float64

## ranking as per apperance of values

In [ ]:
s2.name='unsorted'

In [ ]:
d1=s2.rank(method='first')
d1.name='rank-first'
print('series', "\t" ,'ranks')
for i in range(len(d1)):
  print("{0:<8} {1:.1f}".format(s2.iloc[i],d1.iloc[i]))

series 	 ranks
8        7.0
-5       1.0
8        8.0
4        5.0
2        3.0
3        4.0
-5       2.0
4        6.0

## what is happening here: series are added as row with name of series as row index

In [ ]:
df3=pd.DataFrame([s2,d1])
df3

              0    1    2    3    4    5    6    7
unsorted    8.0 -5.0  8.0  4.0  2.0  3.0 -5.0  4.0
rank-first  7.0  1.0  8.0  5.0  3.0  4.0  2.0  6.0

#problem: create a dataframe having ranking of a data series using different rank method

#adding series as columns of the data frame

In [ ]:
df4=pd.DataFrame()
df4['original']=s2
df4['ranked-first']=d1
df4

   original  ranked-first
0         8           7.0
1        -5           1.0
2         8           8.0
3         4           5.0
4         2           3.0
5         3           4.0
6        -5           2.0
7         4           6.0

In [ ]:
d3=s2.rank(method='max')
d3

0    8.0
1    2.0
2    8.0
3    6.0
4    3.0
5    4.0
6    2.0
7    6.0
Name: unsorted, dtype: float64

In [ ]:
df4.insert(1,'max-rank',d3)
df4

   original  max-rank  ranked-first
0         8       8.0           7.0
1        -5       2.0           1.0
2         8       8.0           8.0
3         4       6.0           5.0
4         2       3.0           3.0
5         3       4.0           4.0
6        -5       2.0           2.0
7         4       6.0           6.0

In [ ]:
df4['meanrank']=df4['original'].rank(method='average')
df4

   original  max-rank  ranked-first  meanrank
0         8       8.0           7.0       7.5
1        -5       2.0           1.0       1.5
2         8       8.0           8.0       7.5
3         4       6.0           5.0       5.5
4         2       3.0           3.0       3.0
5         3       4.0           4.0       4.0
6        -5       2.0           2.0       1.5
7         4       6.0           6.0       5.5

#By default, ranks are computed for each column using mean() method. In case ranks are to be computed rowwise then use axis=1/columns

In [ ]:
df5=df4.rank()
df5.columns=['X','Y','Z','W']
df5

     X    Y    Z    W
0  7.5  7.5  7.0  7.5
1  1.5  1.5  1.0  1.5
2  7.5  7.5  8.0  7.5
3  5.5  5.5  5.0  5.5
4  3.0  3.0  3.0  3.0
5  4.0  4.0  4.0  4.0
6  1.5  1.5  2.0  1.5
7  5.5  5.5  6.0  5.5

In [ ]:
df5.rank(axis=1,method='max')

     X    Y    Z    W
0  4.0  4.0  1.0  4.0
1  4.0  4.0  1.0  4.0
2  3.0  3.0  4.0  3.0
3  4.0  4.0  1.0  4.0
4  4.0  4.0  4.0  4.0
5  4.0  4.0  4.0  4.0
6  3.0  3.0  4.0  3.0
7  3.0  3.0  4.0  3.0

#row labels/index labels may be duplicated. Note reindex() needs unique labels

In [ ]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [ ]:
obj.index.is_unique

False

In [ ]:
obj['a']

a    0
a    1
dtype: int64

#by default no name to dataseries object

In [ ]:
obj.name

In [ ]:
obj.name='Series1'

#find the output?

In [ ]:
df = pd.DataFrame(np.random.randn(5, 3)*2, index=['a', 'a', 'b', 'b','c'],columns=['XX','YY','ZZ'])
df

         XX        YY        ZZ
a  0.636137 -0.272675 -0.440010
a  1.797088 -5.363503  0.450279
b  2.464888 -2.751594 -2.508961
b  1.375123 -2.364279 -0.162705
c  0.617199 -3.981401 -2.044461

In [ ]:
df.loc['b']

         XX        YY        ZZ
b  2.464888 -2.751594 -2.508961
b  1.375123 -2.364279 -0.162705

#Summarizing and Descriptive Statistics

In [ ]:
df.loc['b','YY']=None
df

         XX        YY        ZZ
a  0.636137 -0.272675 -0.440010
a  1.797088 -5.363503  0.450279
b  2.464888       NaN -2.508961
b  1.375123       NaN -0.162705
c  0.617199 -3.981401 -2.044461

#by default Na values are ignored

In [ ]:
df.mean(axis=1)

a   -0.731119
a    0.020714
b   -1.457560
b   -0.357385
c   -0.017059
dtype: float64

In [ ]:
df.mean(axis=1,skipna=False)

a   -0.731119
a    0.020714
b         NaN
b         NaN
c   -0.017059
dtype: float64

#indirect statistics to get index with min value

In [ ]:
df

         XX        YY        ZZ
a  0.636137 -0.272675 -0.440010
a  1.797088 -5.363503  0.450279
b  2.464888       NaN -2.508961
b  1.375123       NaN -0.162705
c  0.617199 -3.981401 -2.044461

In [ ]:
df.idxmin()

XX    c
YY    a
ZZ    b
dtype: object

In [ ]:
df['ZZ'].idxmax()

'a'

In [ ]:
df['ZZ'].cumsum()

a   -0.440010
a    0.010269
b   -2.498692
b   -2.661397
c   -4.705858
Name: ZZ, dtype: float64

#Statistical summary of numeric data

In [ ]:
df

         XX        YY        ZZ
a  2.469835 -2.535221 -2.127972
a -3.394944  1.130319  2.326766
b -1.954144       NaN -0.960977
b  0.950506       NaN -1.665275
c -0.995845 -1.290803  2.235472

In [ ]:
df.rank()

    XX   YY   ZZ
a  4.0  1.0  4.0
a  1.0  2.0  5.0
b  3.0  3.0  2.0
b  2.0  5.0  3.0
c  5.0  4.0  1.0

In [ ]:
df.describe()

             XX        YY        ZZ
count  5.000000  3.000000  5.000000
mean   1.378087 -3.205860 -0.941172
std    0.788376  2.632533  1.271664
min    0.617199 -5.363503 -2.508961
25%    0.636137 -4.672452 -2.044461
50%    1.375123 -3.981401 -0.440010
75%    1.797088 -2.127038 -0.162705
max    2.464888 -0.272675  0.450279

In [ ]:
df['WW']=list('abcce')

#non-numeric columns are ignored in describe

In [ ]:
df

         XX        YY        ZZ WW
a  0.636137 -0.272675 -0.440010  a
a  1.797088 -5.363503  0.450279  b
b  2.464888       NaN -2.508961  c
b  1.375123       NaN -0.162705  c
c  0.617199 -3.981401 -2.044461  e

In [ ]:
df.describe()

             XX        YY        ZZ
count  5.000000  3.000000  5.000000
mean   1.378087 -3.205860 -0.941172
std    0.788376  2.632533  1.271664
min    0.617199 -5.363503 -2.508961
25%    0.636137 -4.672452 -2.044461
50%    1.375123 -3.981401 -0.440010
75%    1.797088 -2.127038 -0.162705
max    2.464888 -0.272675  0.450279

#what is percentile: Used to compare a value with other values in a dataset

How to compute: a)Rank the values in the data set in order from smallest to largest.b) multiply the desired P by N c) round off to nearest integer which gives row index. Use it to get value from the ranked data 3.6=>4

#describe on string data

In [ ]:
df['WW'].describe()

count     5
unique    4
top       c
freq      2
Name: WW, dtype: object

In [ ]:
str1=pd.Series(list('axca')*3)
str1

0     a
1     x
2     c
3     a
4     a
5     x
6     c
7     a
8     a
9     x
10    c
11    a
dtype: object

In [ ]:
str1.describe()

count     12
unique     3
top        a
freq       6
dtype: object

#more statistical functions

#Covariance indicates the direction of the linear relationship between variables and is  affected by the change in scale. Simply stated, covariance is a measure of the relationship between two random variables.
#Correlation measures both the strength and direction of the linear relationship between two variables.

#pairwise correlation of columns
=cov(c1,c2)/std(c1)*std(c2)

where cov(c1,c2)=\sum((c1_i-mean(c1)((c2_i-mean(c2))/N

In [ ]:
df.cov()

          XX        YY        ZZ
XX  5.407232 -5.269808 -3.799606
YY -5.269808  3.474432  3.663333
ZZ -3.799606  3.663333  4.657171

In [ ]:
df.corr()

          XX        YY        ZZ
XX  1.000000 -0.958849 -0.757164
YY -0.958849  1.000000  0.771927
ZZ -0.757164  0.771927  1.000000

In [ ]:
df.corrwith(df.loc[:,'XX'])

XX    1.000000
YY   -0.958849
ZZ   -0.757164
dtype: float64

#unique and membership

In [ ]:
str1=pd.Series(list('axca')*3)
str1

0     a
1     x
2     c
3     a
4     a
5     x
6     c
7     a
8     a
9     x
10    c
11    a
dtype: object

#extract unique values from a series (not on data frame)

In [ ]:
a=str1.unique()
a

array(['a', 'x', 'c'], dtype=object)

In [ ]:
str1.value_counts()

a    6
c    3
x    3
dtype: int64

In [ ]:
a1=np.random.randint(5,10,size=10)
a1

array([6, 8, 8, 8, 5, 8, 6, 6, 8, 8])

In [ ]:
pd.value_counts(a1,sort=False)

5    1
6    3
8    6
dtype: int64

In [ ]:
df

         XX        YY        ZZ WW
a  0.636137 -0.272675 -0.440010  a
a  1.797088 -5.363503  0.450279  b
b  2.464888       NaN -2.508961  c
b  1.375123       NaN -0.162705  c
c  0.617199 -3.981401 -2.044461  e

In [ ]:
df.loc['d']=[2.469835,	-2.535221,	-2.127972,	'a']
df

         XX        YY        ZZ WW
a  0.636137 -0.272675 -0.440010  a
a  1.797088 -5.363503  0.450279  b
b  2.464888       NaN -2.508961  c
b  1.375123       NaN -0.162705  c
c  0.617199 -3.981401 -2.044461  e
d  2.469835 -2.535221 -2.127972  a

#membership isin()

In [ ]:
mask=str1.isin(['a','c'])

In [ ]:
mask

0      True
1     False
2      True
3      True
4      True
5     False
6      True
7      True
8      True
9     False
10     True
11     True
dtype: bool

#benefit of mask: to retrieve selected elements

In [ ]:
str1[mask]

0     a
2     c
3     a
4     a
6     c
7     a
8     a
10    c
11    a
dtype: object

#given are grades obtained by students in three questions

In [ ]:
data = pd.DataFrame({'Qu1': ['A', 'B', 'B', 'C', 'D'],
                     'Qu2': ['A', 'B', 'B', 'D', 'D'],
                     'Qu3': ['B', 'B', 'D', 'D', 'D']})
data

  Qu1 Qu2 Qu3
0   A   A   B
1   B   B   B
2   B   B   D
3   C   D   D
4   D   D   D

In [ ]:
data['Qu2'].value_counts()

D    2
B    2
A    1
Name: Qu2, dtype: int64

#to get  histogram (frequency) of distinct values in each column

In [ ]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
A    1  1.0  0.0
B    2  2.0  2.0
C    1  0.0  0.0
D    1  2.0  3.0

#matching indexed in two data series: to get index value of content in passed series with that of matched series , useful in joining two series or for alignment

In [ ]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])
unique_vals = pd.Series(['c', 'b', 'a'])
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In [ ]:
frame.index

Index(['a', 'e', 'c', 'g', 'g1'], dtype='object')

In [ ]:
I=frame.index.duplicated()
I

array([False, False, False, False, False])

#problem to do:  Generate a data frame with 4 columns and 10 rows. One column is 'Name' of type string and others are named as user-specified and are of Numeric type. Remove duplicate rows. Find correlation between all pairs of attributes which are numeric.
Create a new data frame having name column along with coulmn having correlation >0.5 with rest of columns

In [ ]:
A B C
AA  AB AC
BA  BB  BC
CA   CB  CC    
AB 0.6
AC  0.7
BC 0.4
  
  AC +BC =.55  C >0.55